app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment", "testsamuel"], ["created_at", "2019-03-31 17:31:09.460812"], ["updated_at", "2019-03-31 17:31:09.460812"]]
---
  def create
    @comment = Comment.new(comment_params)
    current_uri = request.env['PATH_INFO']
    path = Rails.application.routes.recognize_path(current_uri)
    respond_to do |format|
      if @comment.save