app/controllers/gazooys_controller.rb

  def index
   @gazooys = Gazooy.all
   @users = User.all
   @profiles = Profile.all
   @pages = Page.all
---
SELECT "gazooys".* FROM "gazooys"
SELECT "users".* FROM "users"
SELECT "profiles".* FROM "profiles"
SELECT  "pages".* FROM "pages" LIMIT ?  [["LIMIT", 11]]

  def create
    @gazooy = Gazooy.new(gazooy_params)
    @gazooy.user = current_user
    respond_to do |format|
      if @gazooy.save
---
INSERT INTO "gazooys" ("user_id", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["text", "azeaze"], ["created_at", "2019-03-28 09:49:47.140895"], ["updated_at", "2019-03-28 09:49:47.140895"]]

    def set_gazooy
      @gazooy = Gazooy.find(params[:id])
---
SELECT  "gazooys".* FROM "gazooys" WHERE "gazooys"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]