app/controllers/home_controller.rb

SELECT "gazooys".* FROM "gazooys"
---
    def index
        # printf(current_user.id)
        # @gazooyAll.each do |@gazooy|
        #     render "gazooys/show"
        #   end
        @gazooys = Gazooy.all