app/controllers/news_controller.rb

  def show
#     doc = RedCloth.new EOD
# @new.content
# EOD
# content_render= doc.to_html
@comments = Comment.all
---
SELECT "comments".* FROM "comments"

  def create
    @news = News.new(news_params)

    respond_to do |format|
      if @news.save
---
INSERT INTO "news" ("title", "summary", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "sasasa"], ["summary", "sasasa"], ["content", "sasaas"], ["created_at", "2019-03-29 11:18:39.825795"], ["updated_at", "2019-03-29 11:18:39.825795"]]

  def destroy
    @news.destroy
---
DELETE FROM "news" WHERE "news"."id" = ?  [["id", 1]]

    def set_news
      @news = News.find(params[:id])
---
SELECT  "news".* FROM "news" WHERE "news"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]