app/controllers/pages_controller.rb

INSERT INTO "pages" ("title", "content", "created_at", "updated_at", "slug") VALUES (?, ?, ?, ?, ?)  [["title", "testsa"], ["content", "sakjbejlkhrklaerar"], ["created_at", "2019-03-29 10:01:42.213710"], ["updated_at", "2019-03-29 10:01:42.213710"], ["slug", "75c07aa3-fc9a-4dba-9eae-508371110f32"]]
---
  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save

UPDATE "pages" SET "slug" = ?, "updated_at" = ? WHERE "pages"."id" = ?  [["slug", "testsam1111"], ["updated_at", "2019-03-31 09:09:45.657251"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @page.update(page_params)

SELECT  "pages".* FROM "pages" WHERE "pages"."slug" = ? LIMIT ?  [["slug", "c9c343d1-fbae-4256-842a-ffa4fd5df709"], ["LIMIT", 1]]
---
    def set_page
      @page = Page.find_by slug: params[:slug]