app/controllers/profiles_controller.rb

  def edit
    test_me = (params[:id])
    if(test_me == 'me')
      @profile = Profile.find(current_user.profile.id)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @profile.update(profile_params)
---
UPDATE "profiles" SET "avatar" = ?, "background" = ?, "name" = ?, "place" = ?, "website" = ?, "bio" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["avatar", "sa1.jpg"], ["background", ""], ["name", ""], ["place", ""], ["website", ""], ["bio", ""], ["updated_at", "2019-03-28 09:24:49.690808"], ["id", 2]]

    def set_profile
      test_me = (params[:id])
      if(test_me == 'me')
        @profile = Profile.find(current_user.profile.id)
      else
        @profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]