app/views/gazooys/index.html.erb

          <td><%= gazooy.text %></td>
          <% if gazooy.user.present?%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]